{
  "allergic bronchopulmonary aspergillosis": {
    "validity": "VALID",
    "rationale": "Prednisone is first-line treatment. ABPA is an allergic/inflammatory response to Aspergillus, not a direct infection. IDSA/WHO guidelines recommend systemic corticosteroids.",
    "evidence": "IDSA guidelines, WHO"
  },
  "herpes zoster": {
    "validity": "VALID",
    "rationale": "Prednisone reduces acute pain and speeds healing when combined with antivirals. Multiple RCTs support adjunctive use. Prevents postherpetic neuralgia.",
    "evidence": "Cochrane review, NICE guidelines"
  },
  "leprosy": {
    "validity": "VALID",
    "rationale": "Prednisolone is essential for Type 1 and Type 2 leprosy reactions (erythema nodosum leprosum). WHO-recommended. Prevents nerve damage.",
    "evidence": "WHO leprosy treatment guidelines"
  },
  "tuberculosis": {
    "validity": "VALID",
    "rationale": "Dexamethasone reduces mortality in TB meningitis by 30% (Thwaites 2004 NEJM). Also used in TB pericarditis. WHO-recommended adjunctive therapy.",
    "evidence": "Thwaites et al. NEJM 2004, WHO TB guidelines"
  },
  "pulmonary tuberculosis": {
    "validity": "QUESTIONABLE",
    "rationale": "For pulmonary TB specifically, evidence is weaker than TB meningitis. Some use for severe inflammation. But CS can also reactivate latent TB (inverse indication conflict).",
    "evidence": "Mixed evidence, Cochrane review shows modest benefit"
  },
  "extrapulmonary tuberculosis": {
    "validity": "VALID",
    "rationale": "Strong evidence for TB meningitis, TB pericarditis, and TB uveitis. Dexamethasone reduces mortality in TB meningitis.",
    "evidence": "Thwaites et al. NEJM 2004"
  },
  "proctitis": {
    "validity": "VALID",
    "rationale": "Proctitis is often inflammatory (IBD-related, radiation-induced). Topical/oral corticosteroids are standard treatment for inflammatory proctitis.",
    "evidence": "AGA guidelines for IBD-related proctitis"
  },
  "cryptococcosis": {
    "validity": "QUESTIONABLE",
    "rationale": "Adjunctive dexamethasone was tested in cryptococcal meningitis (Day et al. NEJM 2014) - showed NO benefit and potentially harmful. IRIS treatment is the only CS indication.",
    "evidence": "Day et al. NEJM 2014 (negative RCT)"
  },
  "fungal meningitis": {
    "validity": "QUESTIONABLE",
    "rationale": "May help with IRIS or inflammation, but not standard for fungal meningitis directly. Dexamethasone trial for cryptococcal meningitis was negative.",
    "evidence": "Limited evidence"
  },
  "influenza": {
    "validity": "QUESTIONABLE",
    "rationale": "COVID-19 showed dexamethasone benefit for severe respiratory illness (RECOVERY trial), but for influenza specifically, WHO ADVISES AGAINST routine CS use. May increase mortality in severe influenza.",
    "evidence": "WHO advises against; Delaney et al. Crit Care 2016 meta-analysis"
  },
  "chronic hepatitis c": {
    "validity": "INVALID",
    "rationale": "CS are immunosuppressive and can worsen viral replication in HCV. No clinical evidence supporting CS for HCV treatment.",
    "evidence": "No supporting evidence"
  },
  "hepatitis b": {
    "validity": "INVALID",
    "rationale": "CS withdrawal can trigger severe HBV flares. CS increase HBV replication. Azathioprine→HBV reactivation is already an inverse indication. CS use is DANGEROUS.",
    "evidence": "AASLD/EASL guidelines warn against"
  },
  "cytomegalovirus infection": {
    "validity": "INVALID",
    "rationale": "CS cause immunosuppression which WORSENS CMV. CS are a known risk factor for CMV reactivation. No therapeutic benefit.",
    "evidence": "CMV reactivation caused by immunosuppression"
  },
  "herpes simplex virus infection": {
    "validity": "INVALID",
    "rationale": "Systemic CS can worsen HSV infections by suppressing immune response. Only use is topical in combination with antivirals for HSV keratitis.",
    "evidence": "Generally contraindicated without antivirals"
  },
  "herpes simplex encephalitis": {
    "validity": "QUESTIONABLE",
    "rationale": "Adjunctive dexamethasone tested in GACHE trial (Kamei et al. 2005, Martinez-Torres et al. 2008) - some evidence for reducing edema, but primary treatment is acyclovir. Not standard.",
    "evidence": "GACHE trial ongoing/mixed results"
  },
  "rabies": {
    "validity": "INVALID",
    "rationale": "No evidence CS help in rabies. Rabies is almost universally fatal once symptomatic. CS would worsen immunosuppression.",
    "evidence": "No supporting evidence"
  },
  "smallpox": {
    "validity": "INVALID",
    "rationale": "CS are contraindicated in smallpox. Immunosuppression worsens viral replication. CDC explicitly warns against CS in smallpox/vaccinia.",
    "evidence": "CDC contraindication"
  },
  "aspergillosis": {
    "validity": "QUESTIONABLE",
    "rationale": "Invasive aspergillosis: CS are a RISK FACTOR (immunosuppression). ABPA: CS are treatment. Depends on type. Most aspergillosis predictions would be invasive → harmful.",
    "evidence": "IDSA guidelines"
  },
  "poliomyelitis": {
    "validity": "INVALID",
    "rationale": "No evidence for CS in polio. Historical use has been abandoned.",
    "evidence": "No supporting evidence"
  },
  "japanese encephalitis": {
    "validity": "INVALID",
    "rationale": "Dexamethasone tested in Japanese encephalitis RCT (Kumar et al. Neurology 2010) - showed NO benefit. WHO does not recommend.",
    "evidence": "Kumar et al. Neurology 2010 (negative RCT)"
  },
  "hepatitis a": {
    "validity": "INVALID",
    "rationale": "No evidence for CS in hepatitis A. Self-limiting disease. CS immunosuppression is not indicated.",
    "evidence": "No supporting evidence"
  },
  "coccidioidomycosis": {
    "validity": "QUESTIONABLE",
    "rationale": "CS may help in coccidioidal meningitis (chronic inflammation), but can also worsen dissemination. Used cautiously in severe cases.",
    "evidence": "Expert opinion, limited data"
  },
  "cryptococcal meningitis": {
    "validity": "INVALID",
    "rationale": "Day et al. NEJM 2014 RCT showed dexamethasone INCREASED mortality in cryptococcal meningitis (OR 1.11). Only for IRIS.",
    "evidence": "Day et al. NEJM 2014"
  },
  "chromomycosis": {
    "validity": "INVALID",
    "rationale": "No evidence for CS in chromomycosis (fungal skin infection). Would worsen immunosuppression.",
    "evidence": "No supporting evidence"
  },
  "acquired immunodeficiency syndrome aids": {
    "validity": "QUESTIONABLE",
    "rationale": "CS used for PJP pneumonia in AIDS (prednisone reduces mortality). But CS generally dangerous in AIDS due to immunosuppression.",
    "evidence": "For PJP only, not general AIDS"
  },
  "respiratory infection caused by pseudomonas aeruginosa in cystic fibrosis": {
    "validity": "QUESTIONABLE",
    "rationale": "Oral CS used in CF for anti-inflammatory effects, but risk of diabetes and growth impairment. Inhaled CS more appropriate.",
    "evidence": "Cochrane CF & CS review"
  },
  "sporotrichosis": {
    "validity": "INVALID",
    "rationale": "No evidence for CS in sporotrichosis. Antifungals are standard treatment.",
    "evidence": "No supporting evidence"
  },
  "zygomycosis": {
    "validity": "INVALID",
    "rationale": "CS are a RISK FACTOR for zygomycosis (mucormycosis). CS immunosuppression promotes fungal invasion.",
    "evidence": "Known risk factor"
  },
  "visceral leishmaniasis caused by leishmania donovani": {
    "validity": "INVALID",
    "rationale": "No evidence for CS in visceral leishmaniasis. Antimonials and amphotericin B are standard.",
    "evidence": "WHO leishmaniasis guidelines"
  },
  "schistosomiasis": {
    "validity": "QUESTIONABLE",
    "rationale": "CS sometimes used for severe schistosomiasis (Katayama fever, neuroschistosomiasis) alongside praziquantel. Not standard monotherapy.",
    "evidence": "Expert opinion for severe cases"
  },
  "otitis media": {
    "validity": "QUESTIONABLE",
    "rationale": "Some evidence for CS as adjunctive in acute otitis media (reduce inflammation), but not standard practice. AAP guidelines do not recommend routine CS.",
    "evidence": "Mixed evidence, not standard"
  },
  "esophageal candidiasis": {
    "validity": "INVALID",
    "rationale": "Inhaled/oral CS are a RISK FACTOR for esophageal candidiasis. CS suppress local immune defenses.",
    "evidence": "Known risk factor"
  },
  "gastroenteritis": {
    "validity": "INVALID",
    "rationale": "No evidence for CS in infectious gastroenteritis. Self-limiting. Supportive care only.",
    "evidence": "No supporting evidence"
  }
}